Revit 2027 API
CableType.Duplicate Method
 Duplicates this Cable Type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CableType Duplicate()
Public Function Duplicate As CableType
public:
CableType^ Duplicate()
member Duplicate : unit -> CableType
Return Value
CableType
 The duplicated Cable Type element.
See Also
Reference
CableType Class
Duplicate Overload
Autodesk.Revit.DB.Electrical Namespace